burakcan/ESP32-8x8-Crawler-Controller/sdkconfig.defaults
# 8x8 Crawler Controller defaults
# Target: ESP32-S3 Mini

# Set target to ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# Flash size (4MB required for OTA partitions)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Use custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Enable HTTP server WebSocket support
CONFIG_HTTPD_WS_SUPPORT=y

# ESP32-S3 specific: Use USB CDC for console (frees GPIO 43/44 for other uses)
CONFIG_ESP_CONSOLE_USB_CDC=y

# ESP32-S3 specific: Enable RMT for WS2812 RGB LED
CONFIG_RMT_ISR_IRAM_SAFE=y

# Task Watchdog Timer - resets device if main loop hangs
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
